[
   {
      "Name":"Exploitability Metrics",
      "Metrics":[
         {
            "Name":"Attack Vector",
            "Code":"AV",
            "description":"This metric reflects the context by which vulnerability exploitation is possible. This metric value (and consequently the Base score) will be larger the more remote (logically, and physically) an attacker can be in order to exploit the vulnerable component.",
            "MetricValues":[
               {
                  "Name":"AV:N",
                  "Vector":"Network",
                  "description":"A vulnerability exploitable with Network access means the vulnerable component is bound to the network stack and the attacker's path is through OSI layer 3 (the network layer). Such a vulnerability is often termed 'remotely exploitable' and can be thought of as an attack being exploitable one or more network hops away (e.g. across layer 3 boundaries from routers)."
               },
               {
                  "Name":"AV:A",
                  "type":"Attack Vector",
                  "description":"A vulnerability exploitable with Adjacent Network access means the vulnerable component is bound to the network stack, however the attack is limited to the same shared physical (e.g. Bluetooth, IEEE 802.11), or logical (e.g. local IP subnet) network, and cannot be performed across an OSI layer 3 boundary (e.g. a router)."
               },
               {
                  "Name":"AV:L",
                  "vector":"Local",
                  "description":"A vulnerability exploitable with Local access means that the vulnerable component is not bound to the network stack, and the attacker's path is via read/write/execute capabilities. In some cases, the attacker may be logged in locally in order to exploit the vulnerability, or may rely on User Interaction to execute a malicious file."
               },
               {
                  "Name":"AV:P",
                  "vector":"Physical",
                  "description":"A vulnerability exploitable with Physical access requires the attacker to physically touch or manipulate the vulnerable component, such as attaching an peripheral device to a system."
               }
            ]
         },
         {
            "Name":"Attack Complexity",
            "Code":"AC",
            "description":"The Attack Complexity metric describes the conditions beyond the attacker's control that must exist in order to exploit the vulnerability. As described below, such conditions may require the collection of more information about the target, the presence of certain system configuration settings, or computational exceptions.",
            "MetricValues":[
               {
                  "Name":"AC:L",
                  "vector":"Low",
                  "description":"Specialized access conditions or extenuating circumstances do not exist. An attacker can expect repeatable success against the vulnerable component."
               },
               {
                  "Name":"AC:H",
                  "vector":"High",
                  "description":"A successful attack depends on conditions beyond the attacker's control. That is, a successful attack cannot be accomplished at will, but requires the attacker to invest in some measurable amount of effort in preparation or execution against the vulnerable component before a successful attack can be expected."
               }
            ]
         },
         {
            "Name":"Privleges Required",
            "Code":"PR",
            "description":"This metric describes the level of privileges an attacker must possess before successfully exploiting the vulnerability.",
            "MetricValues":[
               {
                  "Name":"PR:N",
                  "vector":"None",
                  "description":"The attacker is unauthorized prior to attack, and therefore does not require any access to settings or files to carry out an attack."
               },
               {
                  "Name":"PR:L",
                  "vector":"Low",
                  "description":"The attacker is authorized with (i.e. requires) privileges that provide basic user capabilities that could normally affect only settings and files owned by a user. Alternatively, an attacker with Low privileges may have the ability to cause an impact only to non-sensitive resources."
               },
               {
                  "Name":"PR:H",
                  "vector":"High",
                  "description":"The attacker is authorized with (i.e. requires) privileges that provide significant (e.g. administrative) control over the vulnerable component that could affect component-wide settings and files."
               }
            ]
         },
         {
            "Name":"User Interaction",
            "Code":"UI",
            "description":"This metric captures the requirement for a user, other than the attacker, to participate in the successful compromise of the vulnerable component. This metric determines whether the vulnerability can be exploited solely at the will of the attacker, or whether a separate user (or user-initiated process) must participate in some manner.",
            "MetricValues":[
               {
                  "Name":"UI:N",
                  "vector":"None",
                  "description":"The vulnerable system can be exploited without interaction from any user."
               },
               {
                  "Name":"UI:R",
                  "vector":"Required",
                  "description":"Successful exploitation of this vulnerability requires a user to take some action before the vulnerability can be exploited, such as convincing a user to click a link in an email."
               }
            ]
         },
         {
            "Name":"Scope",
            "Code":"S",
            "Description":"An important property captured by CVSS v3.0 is the ability for a vulnerability in one software component to impact resources beyond its means, or privileges. This consequence is represented by the metric Authorization Scope, or simply Scope.  For more information see the CVSSv3 Specification (https://www.first.org/cvss/specification-document#i2.2).",
            "MetricValues":[
               {
                  "Name":"S:U",
                  "vector":"Unchanged",
                  "description":"An exploited vulnerability can only affect resources managed by the same authority. In this case the vulnerable component and the impacted component are the same."
               },
               {
                  "Name":"S:C",
                  "vector":"Changed",
                  "description":"An exploited vulnerability can affect resources beyond the authorization privileges intended by the vulnerable component. In this case the vulnerable component and the impacted component are different."
               }
            ]
         }
      ]
   },
   {
      "Name":"Impact Metrics",
      "Metrics":[
         {
            "Name":"Confidentiality Impact",
            "Code":"C",
            "description":"This metric measures the impact to the confidentiality of the information resources managed by a software component due to a successfully exploited vulnerability. Confidentiality refers to limiting information access and disclosure to only authorized users, as well as preventing access by, or disclosure to, unauthorized ones.",
            "MetricValues":[
               {
                  "Name":"C:N",
                  "Vector":"NONE",
                  "description":"There is no loss of confidentiality within the impacted component."
               },
               {
                  "Name":"C:L",
                  "type":"Low",
                  "description":"There is some loss of confidentiality. Access to some restricted information is obtained, but the attacker does not have control over what information is obtained, or the amount or kind of loss is constrained. The information disclosure does not cause a direct, serious loss to the impacted component."
               },
               {
                  "Name":"C:H",
                  "vector":"High",
                  "description":"There is total loss of confidentiality, resulting in all resources within the impacted component being divulged to the attacker. Alternatively, access to only some restricted information is obtained, but the disclosed information presents a direct, serious impact."
               }
            ]
         },
         {
            "Name":"Integrity Impact",
            "Code":"I",
            "description":"This metric measures the impact to integrity of a successfully exploited vulnerability. Integrity refers to the trustworthiness and veracity of information.",
            "MetricValues":[
               {
                  "Name":"I:N",
                  "Vector":"NONE",
                  "description":"There is no loss of integrity within the impacted component."
               },
               {
                  "Name":"I:L",
                  "type":"Low",
                  "description":"Modification of data is possible, but the attacker does not have control over the consequence of a modification, or the amount of modification is constrained. The data modification does not have a direct, serious impact on the impacted component."
               },
               {
                  "Name":"I:H",
                  "vector":"High",
                  "description":"There is a total loss of integrity, or a complete loss of protection. For example, the attacker is able to modify any/all files protected by the impacted component. Alternatively, only some files can be modified, but malicious modification would present a direct, serious consequence to the impacted component."
               }
            ]
         }
      ]
   },
   {
      "Name":"Temporal Score Metric",
      "Metrics":[
         {
            "Name":"Exploit Code Maturity",
            "Code":"E",
            "description":"This metric measures the likelihood of the vulnerability being attacked, and is typically based on the current state of exploit techniques, exploit code availability, or active, 'in-the-wild' exploitation. The more easily a vulnerability can be exploited, the higher the vulnerability score.",
            "MetricValues":[
               {
                  "Name":"E:X",
                  "Vector":"Not Defined",
                  "description":"Assigning this value to the metric will not influence the score. It is a signal to a scoring equation to skip this metric."
               },
               {
                  "Name":"E:U",
                  "type":"Unproven That exploit exists",
                  "description":"No exploit code is available, or an exploit is entirely theoretical."
               },
               {
                  "Name":"E:P",
                  "vector":"Proof of concept code",
                  "description":"Proof-of-concept exploit code is available, or an attack demonstration is not practical for most systems. The code or technique is not functional in all situations and may require substantial modification by a skilled attacker."
               },
               {
                  "Name":"E:F",
                  "vector":"Functional exploit exists",
                  "description":"Functional exploit code is available. The code works in most situations where the vulnerability exists."
               },
               {
                  "Name":"E:H",
                  "vector":"High",
                  "description":"Functional autonomous code exists, or no exploit is required (manual trigger) and details are widely available. Exploit code works in every situation, or is actively being delivered via an autonomous agent (such as a worm or virus). Network-connected systems are likely to encounter scanning or exploitation attempts. Exploit development has reached the level of reliable, widely-available, easy-to-use automated tools."
               }
            ]
         },
         {
            "Name":"Remediation Level",
            "Code":"RL",
            "description":"The Remediation Level of a vulnerability is an important factor for prioritization. The typical vulnerability is unpatched when initially published. Workarounds or hotfixes may offer interim remediation until an official patch or upgrade is issued. Each of these respective stages adjusts the temporal score downwards, reflecting the decreasing urgency as remediation becomes final.",
            "MetricValues":[
               {
                  "Name":"RL:X",
                  "Vector":"Not Defined",
                  "description":"Assigning this value to the metric will not influence the score. It is a signal to a scoring equation to skip this metric."
               },
               {
                  "Name":"RL:O",
                  "type":"Official Fix",
                  "description":"A complete vendor solution is available. Either the vendor has issued an official patch, or an upgrade is available."
               },
               {
                  "Name":"RL:T",
                  "vector":"Temporary Fix",
                  "description":"There is an official but temporary fix available. This includes instances where the vendor issues a temporary hotfix, tool, or workaround."
               },
               {
                  "Name":"RL:W",
                  "vector":"Workaround",
                  "description":"There is an unofficial, non-vendor solution available. In some cases, users of the affected technology will create a patch of their own or provide steps to work around or otherwise mitigate the vulnerability."
               },
               {
                  "Name":"RL:U",
                  "vector":"Unavailable",
                  "description":"There is either no solution available or it is impossible to apply."
               }
            ]
         },
         {
            "Name":"Report Confidence",
            "Code":"RC",
            "description":"This metric measures the degree of confidence in the existence of the vulnerability and the credibility of the known technical details. Sometimes only the existence of vulnerabilities are publicized, but without specific details. The vulnerability may later be corroborated by research which suggests where the vulnerability may lie, though the research may not be certain. Finally, a vulnerability may be confirmed through acknowledgement by the author or vendor of the affected technology.",
            "MetricValues":[
               {
                  "Name":"RC:X",
                  "Vector":"Not Defined",
                  "description":"Assigning this value to the metric will not influence the score. It is a signal to the equation to skip this metric."
               },
               {
                  "Name":"RC:U",
                  "type":"Unknown",
                  "description":"There are reports of impacts that indicate a vulnerability is present. The reports indicate that the cause of the vulnerability is unknown, or reports may differ on the cause or impacts of the vulnerability. Reporters are uncertain of the true nature of the vulnerability, and there is little confidence in the validity of the reports or whether a static Base score can be applied given the differences described."
               },
               {
                  "Name":"RC:R",
                  "vector":"Reasonable",
                  "description":"Significant details are published, but researchers either do not have full confidence in the root cause, or do not have access to source code to fully confirm all of the interactions that may lead to the result. Reasonable confidence exists, however, that the bug is reproducible and at least one impact is able to be verified (proof-of- concept exploits may provide this)."
               },
               {
                  "Name":"RC:C",
                  "vector":"Confirmed",
                  "description":"Detailed reports exist, or functional reproduction is possible (functional exploits may provide this). Source code is available to independently verify the assertions of the research, or the author or vendor of the affected code has confirmed the presence of the vulnerability."
               }
            ]
         }
      ]
   }
]