[
    {
        "name": "Computer Vision API",
        "description": "Allows you to analyze images and videos, extract information, and perform tasks such as object detection, image tagging, and image recognition.",
        "aliases": [
            "computerVision"
        ]
    },
    {
        "name": "Custom Vision API",
        "description": "Allows you to train custom image classification models for your specific needs.",
        "aliases": [
            "customVision"
        ]
    },
    {
        "name": "Content Moderator API",
        "description": "Allows you to automatically moderate text, image, and video content for offensive, sexual, or other unwanted content.",
        "aliases": [
            "contentModerator"
        ]
    },
    {
        "name": "Face API",
        "description": "Allows you to detect and recognize faces, as well as perform tasks such as facial recognition and facial emotion detection.",
        "aliases": [
            "faceApi",
            "face"
        ]
    },
    {
        "name": "Speech API",
        "description": "Allows you to convert speech to text, text to speech, and perform tasks such as speech recognition, transcription, and speech synthesis.",
        "aliases": [
            "speechservices",
            "face"
        ]
    },
    {
        "name": "Text Analytics API",
        "description": "Allows you to extract insights from unstructured text, such as sentiment analysis, key phrase extraction, and language detection.",
        "aliases": [
            "textAnalytics",
            "text_analytics"
        ]
    },
    {
        "name": "Translator Text API",
        "description": "Allows you to translate text from one language to another.",
        "aliases": [
            "translator",
             "TextTranslation"
        ]
    },
    {
        "name": "Language Understanding API",
        "description": "Allows you to understand the intent and entities in text, and to perform tasks such as natural language understanding and natural language generation.",
        "aliases": [
            "languageUnderstanding"
        ]
    },
    {
        "name": "Anomaly Detector API",
        "description": "Allows you to detect anomalies in time-series data, such as sensor data or log files.",
        "aliases": [
            "anomolyDetector",
             "anomalyDetector"
        ]
    },
    {
        "name": "Form Recognizer API",
        "description": "Allows you to extract information from forms such as receipts, invoices, and ID cards.",
        "aliases": [
            "formRecognizer"
        ]
    },
    {
        "name": "Personalizer API",
        "description": "Allows you to personalize the user experience by learning from the user's interactions and making real-time decisions.",
        "aliases": [
            "personalizer"
        ]
    },
    {
        "name": "QnA Maker API",
        "description": "Allows you to create a knowledge base of question-answer pairs and use it to automatically answer questions from users.",
        "aliases": [
            "q_and_a",
            "qna"
        ]
    },
    {
        "name": "Search API",
        "description": "Allows you to add search functionality to your application, such as web search, document search, and suggestions.",
        "aliases": [
            "searchApi",
            "search_api"
        ]
    }
]
